## 변수 선언 부분 ##
money, c500, c100, c50, c10 = 0, 0, 0, 0, 0 # 값 초기화

## 메인 코드 부분 ##
money=int(input("교환할 돈은 얼마 ? "))

c500 = money // 500 # 500원 짜리 동전 개수 구함
money %= 500 # 나머지 값 저장

c100 = money // 100 # 100원 짜리 동전 개수 구함
money %= 100 # 나머지 값 저장

c50 = money // 50 # 50원 짜리 동전 개수 구함
money %= 50 # 나머지 값 저장

c10 = money // 10 # 10원짜리 동전 개수 구함
money %= 10 # 나머지 값 저장(바꾸지 못한 남은 잔돈)

print("\n 500원짜리 ==> %d개" % c500)
print(" 100원짜리   ==> %d개 " % c100)
print(" 50원짜리 ==> %d개 " % c50)
print(" 10원짜리   ==> %d개 " % c10)
print(" 바꾸지 못한 잔돈 ==> %d원" % money) # 10 미만
